In [3]:
#Q1

import pandas as pd
se = pd.Series([4,8,15,16,23,42])
se

0     4
1     8
2    15
3    16
4    23
dtype: int64

In [5]:
#Q2

l1 = [1,2,34,5,6,7,8,5,12,56]
s2 = pd.Series(l1)
s2

0     1
1     2
2    34
3     5
4     6
5     7
6     8
7     5
8    12
9    56
dtype: int64

In [7]:
#Q3

data = { 'Name' : ['Alice' , 'Bob' , 'Claire'],
         'Age' : [25,30,27],
         'Gender' : ['Female' , 'Male' , 'Female']
        }

df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4

DataFrame in pandas is a 2 dimensional structure having columns and rows where each column represents the varaible and row represents the value of those variables. It can thought as a tabular data structure
which provide functionalites for manipulating and transforming data in dataframe. 

DataFrame is collections of series and series is a column of dataframe.
Series contains only one column data and it is one dimensional data structure.

In [8]:
#example 

#here s is series which is a column of dataframe df
s = pd.Series(['Alice' , 'Bob' , 'Claire'])

# and df is a dataframe defines in Q3

# Q5

Pandas provide many functions to munipuate data in pandas dataframe such as head() which is use to read data from dataframe from head , tail() which is use to read data from dataframe from tail i.e from last , info() which is use to get information about columns and its datatype of data in dataframe , shape() which is use to get the shape of dataframe , etc.

In [9]:
# example 

df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [10]:
df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

In [11]:
df.shape

(3, 3)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

# Q6

Series and DataFrame can be modified after creation but panel is not mutable

# Q7

In [15]:
name_series  = pd.Series(['Alice' , 'Bob' , 'Claire'])
age_series = pd.Series([25,30,27])
gender_series = pd.Series(['female' , 'male' , 'female'])

data = { 'Name' : name_series , 
         'Age' : age_series,
            'Gender' : gender_series   }

df = pd.DataFrame(data)

In [16]:
df

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female